Terraform Plan Output:
```
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.data.aws_caller_identity.current: Reading...
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=6fc857a1-0425-4f47-bfe3-d54e40457140]
module.appcd_65b99755-8957-522f-9ed4-1242d9ecbad4.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-harsh-function]
module.appcd_2fc706f9-6176-58c1-862d-78de66dfc1ea.aws_iam_role.this: Refreshing state... [id=hello-kitty-harsh-role]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_220481a5-c44d-4db7-9b90-9c1160f1937a.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-harsh-role:Writer]
module.appcd_477ae9b8-2fbb-5293-b835-eedd87db50b9.aws_lambda_function.this: Refreshing state... [id=hello-kitty-harsh-function]
module.appcd_477ae9b8-2fbb-5293-b835-eedd87db50b9.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-harsh-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-harsh"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "6fc857a1-0425-4f47-bfe3-d54e40457140"
    }

  # module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "harsh"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "hello-kitty-harsh"
          + "component" = "hello-kitty-harsh"
        }
      + tags_all                    = {
          + "appstack"  = "hello-kitty-harsh"
          + "component" = "hello-kitty-harsh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "6fc857a1-0425-4f47-bfe3-d54e40457140"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_e65da2f9-bc25-43a9-89b0-7838ca60f2af.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-harsh-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-harsh-role"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_s3_harsh_arn                                                    = (known after apply)
  + aws_s3_harsh_bucket_name                                            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```